app/Controllers/BookController.php

    public function create()
    {
        $model = new BookModel();
        $data['books'] = $model->findAll();
---
SELECT *
FROM `books`