app/Controllers/CustomerController.php

SELECT *
FROM `customers`
---
    public function user()
    {
        $customerModel = new CustomerModel();
        $data['customers'] = $customerModel->findAll();