app/Controllers/LoanController.php

    public function index()
    {
        $data = [
            'books' => $this->bookModel->findAll(),
            'customers' => $this->customerModel->findAll(),
            'loans' => $this->loanModel->getLoans()
        ];
---
SELECT *
FROM `books`
SELECT *
FROM `customers`