app/Models/LoanModel.php

    public function getLoans()
    {
        return $this->db->table('loans')
            ->select('loans.*, books.title AS book_title, customers.name AS customer_name')
            ->join('books', 'books.id_book = loans.book_id', 'left')
            ->join('customers', 'customers.id_customer = loans.customer_id', 'left')
            ->get()
            ->getResultArray();
---
SELECT `loans`.*, `books`.`title` AS `book_title`, `customers`.`name` AS `customer_name`
FROM `loans`
LEFT JOIN `books` ON `books`.`id_book` = `loans`.`book_id`
LEFT JOIN `customers` ON `customers`.`id_customer` = `loans`.`customer_id`